app/Models/m_admin.php

SELECT `login`, `motPasse`, `role`
FROM `users`
WHERE `login` = 'Chatan'
---
    public function connexion($login)
    {
        // Connexion à la base de données
        $db = db_connect();

        // Requête
        $query = $db->table('users')
            ->select('login, nom, prenom, motPasse, role')
            ->where('login', $login)
            ->get();