app/Models/m_ludique.php

    function genereAlea($themes,$nbQuestions) {
        $db = db_connect();

        // Sélectionner des questions avec un ou plusieurs thèmes
        $numQuestionsAleatoires = $db->table('questions')
            ->select("questions.id")
            ->whereIn('questions.theme', $themes)
            ->orderBy("RAND()")
            ->limit($nbQuestions)
            ->get()
            ->getResultArray();
---
SELECT `questions`.`id`
FROM `questions`
WHERE `questions`.`theme` IN ('Bd','Manga')
ORDER BY RAND()
 LIMIT 8

    function recupQuestionsReponses($themes,$nbQuestions) {
        $result = false;
        $db = db_connect();

        // Récupérer les IDs des questions
        $listeNumero = $this->genereAlea($themes,$nbQuestions);

        // Ensuite, récupérer les réponses correspondantes aux questions sélectionnées
        $query = $db->table('questions')
            ->select("questions.id as id, questions.libelle as question, questions.image as image, questions.theme as theme, propositions.libelle as reponse, est_correcte")
            ->join('associer', 'associer.question_id = questions.id')
            ->join('propositions', 'propositions.numero = associer.proposition_id')
            ->whereIn('questions.id', $listeNumero)
            ->whereIn('questions.theme', $themes)
            ->orderBy("questions.libelle")
            ->get();
---
SELECT `questions`.`id` as `id`, `questions`.`libelle` as `question`, `questions`.`image` as `image`, `questions`.`theme` as `theme`, `propositions`.`libelle` as `reponse`, `est_correcte`
FROM `questions`
JOIN `associer` ON `associer`.`question_id` = `questions`.`id`
JOIN `propositions` ON `propositions`.`numero` = `associer`.`proposition_id`
WHERE `questions`.`id` IN ('21','42','58','50','44','20','17','57')
AND `questions`.`theme` IN ('Bd','Manga')
ORDER BY `questions`.`libelle`